// Предметна область   -   Агенство обміну і продажу нерухомості.
// Розв'язувані задачі -  видача довідок про характеристики нерухомості.
//                        (наприклад, район, площа квартири, кількість кімнат, поверх, ціна, адреса тощо),
//                        і заявки клієнтів (обмін, купівля або продаж, адреса і телефон, дата заявки).
// Реалізувати наступні сервіси: 
//                               Заповнення бази даних
//                               Перегляд даних про всі заявки
//                               Доповнення бази даних
//                               Видалення із бази даних
// Упорядкування по полях :   ПІБ клієнтів, площа квартир
// Пошук :   координати клієнта по прізвищу, по номеру телефона
// Вибірка : N - кімнатні квартири не на першому поверсі;
//           квартири площею від АА до ВВ у районі СС
// 	         Обчислення : середня ціна трикімнатної квартири; сумарне число заявок по районах міста
// 	         Корекція : видалення зведень про виконані заявки;
//           зміна ціни квартири заданого клієнта з ХХ на УУ
// 	         Табличний звіт : список квартир; груповання по районах і кількості кімнат
// 	         Додаткові вимоги : дата заявки не повинна бути пізніше поточного числа,
// 	         а ПІБ і адреса клієнта - не порожніми значеннями.
// 	         Для обробки даних скористатися динамічним масивом покажчиків на структури 
// 	         відповідного типу.

#include <iostream>
#include <string>
using namespace std;



int main() {



	system("pause");
	return 0;
}